//*****************************************************************************
//
// オブジェクト管理リスト [objectList.h]
// Author : MAI TANABE
//
//*****************************************************************************

#ifndef MY_OBJECT_LIST_H_
#define MY_OBJECT_LIST_H_
//=============================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "..\..\main\main.h"
#include "..\list.h"

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// クラス定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class ObjectBase;

class ObjectList : public List
{
public:
	ObjectList(void);
	~ObjectList(void);

	static bool Create(ObjectList** outPointer);

	void Link(ObjectBase* object);
	void UnLink(ObjectBase* object);

	void AllDarelete(void);
};

//=============================================================================
#endif

// EOF
