//*****************************************************************************
//
// オブジェクト管理リスト [objectList.cpp]
// Author : MAI TANABE
//
//*****************************************************************************

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "objectList.h"
#include "..\..\common\safe.h"

#include "..\..\objectBase\objectBase.h"

//=============================================================================
// コンストラクタ
//=============================================================================
ObjectList::ObjectList(void) : List(1)
{
	//----------------------------
	// メンバー初期化
	//----------------------------
	m_top[0] = nullptr;
	m_end[0] = nullptr;
}

//=============================================================================
// デストラクタ
//=============================================================================
ObjectList::~ObjectList(void)
{
}

//=============================================================================
// 生成
//=============================================================================
bool ObjectList::Create(ObjectList** outPointer)
{
	ObjectList* pointer = new ObjectList();

	*outPointer = pointer;
	return true;
}

//=============================================================================
// リンク
//=============================================================================
void ObjectList::Link(ObjectBase* object)
{
	//----------------------------
	// 前オブジェクトの設定
	//----------------------------
	if(m_top[0] == nullptr)
	{
		// 先頭に設定
		m_top[0] = object;
		object->objectPrev(nullptr);
	}
	else
	{
		// 前オブジェクトから連結
		m_end[0]->objectNext(object);
		object->objectPrev(m_end[0]);
	}

	//----------------------------
	// 次オブジェクトの設定
	//----------------------------
	object->objectNext(nullptr);

	//----------------------------
	// 終端オブジェクトの設定
	//----------------------------
	m_end[0] = object;
}

//=============================================================================
// リンク解除
//=============================================================================
void ObjectList::UnLink(ObjectBase* object)
{
	ObjectBase* prev = object->objectPrev();
	ObjectBase* next = object->objectNext();

	//----------------------------
	// 前オブジェクトの再設定
	//----------------------------
	if(prev != nullptr)
	{
		// 前オブジェクトに次オブジェクトを連結
		prev->objectNext(next);
	}
	else
	{
		// 先頭オブジェクトを変更
		m_top[0] = next;

		if(m_top[0] != nullptr)
			// 先頭の前をnullptrに
			m_top[0]->objectPrev(nullptr);
	}

	//----------------------------
	// 次オブジェクトの再設定
	//----------------------------
	if(next != nullptr)
	{
		// 次オブジェクトに前オブジェクトを連結
		next->objectPrev(prev);
	}
	else
	{
		// 終端オブジェクトを変更
		m_end[0] = prev;

		if(m_end[0] != nullptr)
			// 終端をnullptrに
			m_end[0]->objectNext(nullptr);
	}

	//----------------------------
	// オブジェクトリストを解除
	//----------------------------
	object->objectList(nullptr);
}

//=============================================================================
// 全オブジェクトの削除
//=============================================================================
void ObjectList::AllDarelete(void)
{
	ObjectBase* cur	 = m_top[0];
	ObjectBase* next = nullptr;

	while(cur)
	{
		next = cur->objectNext();

		SafeFinalizeDelete(cur);

		cur = next;
	}
}

// EOF
